In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv('archive/basic2.csv', parse_dates=['Date'])
df.head()

        Date     Sales      PV      UV  Events
0 2022-01-01  22711525  397349  4421.0       1
1 2022-01-02     36779    3969  2289.0       0
2 2022-01-03  13943875  373890     NaN       1
3 2022-01-04   8088593  142054  2157.0       0
4 2022-01-05   2395374  190684     NaN       0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 28.6 KB

In [6]:
df['year'] = df['Date'].dt.year
df['month'] = df['Date'].dt.month
df['day'] = df['Date'].dt.day
df['dayofweek'] = df['Date'].dt.dayofweek

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       730 non-null    datetime64[ns]
 1   Sales      730 non-null    int64
 2   PV         730 non-null    int64
 3   UV         684 non-null    float64
 4   Events     730 non-null    int64
 5   year       730 non-null    int32
 6   month      730 non-null    int32
 7   day        730 non-null    int32
 8   dayofweek  730 non-null    int32
dtypes: datetime64[ns](1), float64(1), int32(4), int64(3)
memory usage: 40.1 KB

In [7]:
df.head()

        Date     Sales      PV      UV  Events  year  month  day  dayofweek
0 2022-01-01  22711525  397349  4421.0       1  2022      1    1          5
1 2022-01-02     36779    3969  2289.0       0  2022      1    2          6
2 2022-01-03  13943875  373890     NaN       1  2022      1    3          0
3 2022-01-04   8088593  142054  2157.0       0  2022      1    4          1
4 2022-01-05   2395374  190684     NaN       0  2022      1    5          2

In [8]:
df['weekend'] = df['dayofweek'].apply(lambda x: x>=5)

df.head()

,Date,Sales,PV,UV,Events,year,month,day,dayofweek,weekend
0,2022-01-01,22711525,397349,4421.0,1,2022,1,1,5,True
1,2022-01-02,36779,3969,2289.0,0,2022,1,2,6,True
2,2022-01-03,13943875,373890,NaN,1,2022,1,3,0,False
3,2022-01-04,8088593,142054,2157.0,0,2022,1,4,1,False
4,2022-01-05,2395374,190684,NaN,0,2022,1,5,2,False

In [13]:
weekend_cond = (df['year']==2022) & (df['month']==5) & (df['weekend']==True)
weekday_cond = (df['year']==2022) & (df['month']==5) & (df['weekend']==False)

In [15]:
weekend_sales = df[weekend_cond]['Sales'].mean()
weekday_sales = df[weekday_cond]['Sales'].mean()

print(round(abs(weekend_sales - weekday_sales),1))

3010339.1